import pandas as pd

In [6]:
entries = {
    'maths' : [50,45,34,23,35],
    'science' : [34,89,54,35,90]
}

In [28]:
df1 = pd.DataFrame(entries)

In [29]:
df1

   maths  science
0     50       34
1     45       89
2     34       54
3     23       35
4     35       90

In [14]:
df1['maths']

0    50
1    45
2    34
3    23
4    35
Name: maths, dtype: int64

In [15]:
df1.loc[3]

maths      23
science    35
Name: 3, dtype: int64

In [16]:
df1[df1['maths'] > 40]

   maths  science
0     50       34
1     45       89

In [17]:
df1[df1['maths'] > 40]['maths']

0    50
1    45
Name: maths, dtype: int64

In [20]:
df1[(df1['maths'] > 40) & (df1['science']>35)]

   maths  science
1     45       89

In [21]:
entries1 = {
    'maths' : [90,55,30,34,60],
    'science' : [70,81,64,33,77]
}

In [30]:
df2 = pd.DataFrame(entries1)

In [31]:
df2

   maths  science
0     90       70
1     55       81
2     30       64
3     34       33
4     60       77

In [32]:
df3 = pd.concat([df1,df2])

In [33]:
df3

   maths  science
0     50       34
1     45       89
2     34       54
3     23       35
4     35       90
0     90       70
1     55       81
2     30       64
3     34       33
4     60       77

In [34]:
df3 = df3.reset_index()

In [35]:
df3

   index  maths  science
0      0     50       34
1      1     45       89
2      2     34       54
3      3     23       35
4      4     35       90
5      0     90       70
6      1     55       81
7      2     30       64
8      3     34       33
9      4     60       77

In [36]:
def add_column(row):
    return row['maths'] + row['science']

In [37]:
df3['total'] = df3.apply(add_column,axis =1)

In [40]:
df3

   index  maths  science  total
0      0     50       34     84
1      1     45       89    134
2      2     34       54     88
3      3     23       35     58
4      4     35       90    125
5      0     90       70    160
6      1     55       81    136
7      2     30       64     94
8      3     34       33     67
9      4     60       77    137

In [41]:
df3.sum(axis = 0)

index        20
maths       456
science     627
total      1083
dtype: int64

In [42]:
df3 = df3.drop(['index'],axis=1)

In [43]:
df3

   maths  science  total
0     50       34     84
1     45       89    134
2     34       54     88
3     23       35     58
4     35       90    125
5     90       70    160
6     55       81    136
7     30       64     94
8     34       33     67
9     60       77    137

In [44]:
entries2 ={
    'math' : [50,None],
    'science':[45,56]
}

In [45]:
df4 = pd.DataFrame(entries2)

In [46]:
df4

   math  science
0  50.0       45
1   NaN       56

In [49]:
df5 = df4.fillna(0)

In [50]:
df5

   math  science
0  50.0       45
1   0.0       56

In [52]:
df6 = df4.dropna()

In [53]:
df6

   math  science
0  50.0       45

In [54]:
df3.to_csv('pandas-demo.csv')